#+title: Python 1
#+author: Shaurya Singh

What python version are you running?
#+begin_src bash :results output
python3 --version
#+end_src

#+RESULTS:
: Python 3.9.6

Test your editor
#+begin_src python :results output
print("Hello World")
print("Welcome To the Robotics Team")
#+end_src

#+RESULTS:
: Hello World
: Welcome To the Robotics Team

Task1: Simple solution
#+begin_src python
print('The sum is %.1f' %(float(input('Enter first number: ')) + float(input('Enter second number: ')) + float(input('Enter third number: '))))
#+end_src

Arnav's solution (notice his use of error handling)
#+begin_src python
#Code by: Arnav Ambre
# 7/19/21
def getNumber(index):
    while True:
        try:
            x = float(input("Hey broski, enter the " + index + " number: "))
            break
        except ValueError:
            print("Thats not a number! Try again.")
    return x

x = getNumber("first")
y = getNumber("second")
z = getNumber("third")
print("Here is the sum of the numbers:", x + y + z)
#+end_src

